read_verilog counter.v alu.v mux2x1.v mini_soc.v
hierarchy -check -top mini_soc
proc
opt
fsm
opt
memory
opt
techmap
opt
show
write_verilog mini_soc_netlist.v
